<?php
/*
 ....    .    . .  ..  .  .         ..    .   . ... .......      ..    .  . .   
.  .  ..  ... .. .....     .. ... .. .. ..... .. . .   ՞.. .  ..   ..  . ... .. 
 ....    .. . ...... . ...   ..  . .. . . .    .  .  ..ւ՞ . ..  .....  .  ......
... . .          . .... ..... .... . ..    ...   .  .    .հհ. .... ..     ..    
  .. ..  . ..... .  ....  .. .  .  .... .   ...... ...  . . աւ՞.   . . ... .. ..
        .  . ..   ... ..... ՞. .  . ....   . ... ..  . .   ...հ՞     . ..       
  .. ... .  ... . .     ..  .....   ..   ...    . ... .  ․     .ւ՞.  ... . ...  .
. .  ...        .   .   .   .. . ...  .. .   . ..   .  ......  .. ւ. ..... ... .
 . .    .         ի      ..... ... ւԷա.    . . . .. ...   . ... . . հ  .. ..   . .
 . .. ..  . ․ .    ա. . .....    ՞հաւ՞հ՞. .....       .  ... .... . .ււ՞  .     . 
  ...  .   ..ի    .ա․ ․. ... .ւաաաաաաաաաա՞ի  ․ . . .. ..    .. ..     ււ  ..    . 
 . ..... .....ւ .   ա.   ....ււհհաաաաաաահ.  .. . . ... . .    . .  . հ.ւ  .    ․  
 .   ..   .. ..ի... հ .. ... աաահ.աաաա՞հա  ..  .  .   ... .. . .      հւ . .     
.  .  .. .. .   հ՞..հհ...... ահհաահհհհ՞բա  ....  . . . . . . ...    .ւււ   . . .
 ..  .    ..    ..հհ .հ .՞հւ՞.՞..ււաւ ...  .ւ     .  . .   .  .  .. .հաահ   .. ..
. .   . .  .. ... .աաաահհհաա ահււ հա .. ՞.. . .ււ.ււ...  հւ.   .հհաաաաա՞..  . ..
 . . .. ...  .. բհաա  .աաաաաաւաաաահ.աւ    . .՞աաաաաաաաաււ.ահ.՞հաաաաաաաա աաաաաա....
 ... ... .......ւաաա  աաաաաաաաաաաաա. .՞.  աաաաաաաաաաաաաաաաաաաաաաաաաաահ . .   
. .. .      ...  խաա   աաաաաաաաաաաաաահ ւ.  .. . .... .  ..  ......  ..աա.    ...
   .      .......  աաաա ւահ. աաաաաաաահա՞հ.   .. ...  .     .    .. ...աա      ..
 .. .  .    . ... ..     հհ   հաաաաաաահ.՞ւ. ... ...  ....  . ...    ..աա  ...   
  .   .     .. ..  ... ...ա ....աաաաահհհհհ՞  ..   .  . ..... . .. .  հահ. ......
. .  .  .   . .... .. ..հաահ ... աահհ.ւ՞հւ՞  .  . ... ..  ...  .  . .ահ  ..   ..
...     . . . . .....ւաաաաաաաաաաաաաաահւ՞.՞.    ..... .  . .. . ..    աա .. .. ..
. ....      .. .. .  ւաաաաաաաաաահաաաաա.. .  .....     . ...  .... ..աա    ......
...   ...  . ...  ... աաաաաահաաւա ա..ւհհ՞. .   . ...    .. ....    ւաւ  . .     
.    .... .... .. ... աաւււ աաա.աահհ  .աււ՞.      ... .        .. .ահ.. ........
.. .... .    ...    .աաաաահ հա ա.հւ՞ա ա.՞՞՞ւ .՞ .՞..   ... . .....հհ.. .. . .   
     ........  .  .ւաաաաաաաաաաաաաահհ.  . ՞ւ՞. .աաւ.  .  ... .   ւաւ . . .. .....
.       ...   ... աաաաաաաաահ.ււա՞ հ՞ւահ ՞՞.. .աաաաահ.    . .  .հա     .. . .  ..
.. . .. .. . ..  աաաաաաաաւա՞հահհա աւա..ւ.. .. աաաաաաաւ՞  .... հ  ....     ...   
.   .  ....   . . աաաաաաաահ՞հ.աււ. ւաաււ՞աաւ.աաաաաաաաաահ՞ . հ. .... .  .  .  . .
..  .. ..  ...     .ւաաաաաաաաաա.հւհաահհ՞ւաահաաաաաաաաաաաաաւհ .     .. ... ..  .. 
.... .. .. .... . ...  ւ աաաահաահհաահհւհհ.. .. հաաաաաահաաաա՞հ.....  . .  .   ...
...    . .  .. . .. . . աաաահաւհհաաաւ ւհ    . . ... հաաահահ. ա    .   . ..... . 
.  .. . .. . ....     .աաաաաաահահահհւաա.   ... .   .. ..հաաաա ... ..   .  ... . 
. . .   .. . .....  .ւաաաաաաաաաաաաահաաւ. ..  .  . ..   . ահհհւ...  .  .. . ..  .
        ....   .  . .աաաաաաաաաահահ.հ  ..... ......   .   աաաւ ւ՞հ.. .  ....  ...
 .. .... . ...  ... աաաաաահ  . ... ...  .....   .. . .   աաաա ւ.ւ.... . .  ... .
    . ...   ..  .  հաաաաաւ......   ....    . .. . .. .. . հաաաա՞  .  . .   .....
..   ..  .  .. .   աաաաա.. ....  ..   . .   . . ... . .. . .աաաա՞հհհ..    .  . .
.    .   . .... . աաաաա   . ..... .   . . . .  .. ... .  .... աաաաաահ...   .. . 
    .. .. ..... .աաաաա ...  . .... ..   ... .  . ....  ...  . .հաաաաաա. ...  . .
.   ..     .՞ւ.աաաաաաւ ... . . . .  .  ..    ...    ... ..     .աաաահ....     . 
  .. ՞ . հհւ.. աաաաա.     ..     ... . . .....  . .. .   .     ւ՞ւհ՞՞...  .. .  
ա.աաւա՞.    ՞..  ..՞ա՞ . ..     .   ..... .   . . ....  . .աաաահււահ ՞՞՞  ... ..
աաաաահ.  .ահ     .աա .ահ.   ..  ..   ..   ..  .     .. աաաաաաաաաաաաաաւ.՞.   ւհ  
աաաաաաա.   ՞.՞   ՞ա. . ՞աա՞    .....  .  .. ..... .  .աաաաաաաահաաաաաաաաւ.հ.     
աաաաււ    .  . հաաա՞հհ  հա.՞  .   . .. .    .......  հաաաաաաաաաաաաաաաաաաահա՞հ  .
  ւ.ւււաւհ  .   հւհհ ա.  ււ՞. .  .     .. ..   .   . հաաաաաաաաաաաաաաաաաաա  ՞աա  
*/

// Կլաս, որը կառուցում է Բուն Հայկյան Տոմարով ամսաթվեր
// Աշխատում է միայն մեր թվարկության ամսաթվերի համար
// Հեղինակ։ Հանուման
// Հեղինակի կայք։ http://ablog.gratun.am
// Գիթհաբում: 

// ՀԱՅԿԱՆ ՏՈՄԱՐԻ ՍԿԻԶԲԸ, ըստ տարբեր աղբյուրների
// ՏԱՐԲԵՐԱԿ 1 մթա 2492 ,օգոստոսի 11 	աղբյուր https://hayaryakanch.wordpress.com/2011/06/29/%D5%B0%D5%A1%D5%B5%D5%B8%D6%81-%D5%B6%D5%A1%D5%AD%D5%A1%D6%84%D6%80%D5%AB%D5%BD%D5%BF%D5%B8%D5%B6%D5%A5%D5%A1%D5%AF%D5%A1%D5%B6-%D5%BF%D5%B8%D5%B4%D5%A1%D6%80%D5%AB-%D5%A4%D5%AB%D6%81%D5%A1%D5%AF/
// ՏԱՐԲԵՐԱԿ 2 մթա 2341 ,հուլիսի 14 		աղբյուր https://www.youtube.com/watch?v=1UF6aNYk1qc

// ստուգումներ կոնվերտեր http://haytomar.com/converter.php?l=am
// ստուգումներ տարիների աղյուսակ http://ru.wikipedia.org/wiki/%D0%94%D1%80%D0%B5%D0%B2%D0%BD%D0%B5%D0%B0%D1%80%D0%BC%D1%8F%D0%BD%D1%81%D0%BA%D0%B8%D0%B9_%D0%BA%D0%B0%D0%BB%D0%B5%D0%BD%D0%B4%D0%B0%D1%80%D1%8C 


/*
------------------------ՕԳՏԱԳՈՐԾՈՒՄ------------------------

------------------------1․ ԿՈՆՍՏՐՈՒԿՏՈՐՆԵՐ------------------

1.1
$ArmDate = new ArmHaykyanDate(1); 
//կառուցում է ամսաթվի օբյեկտը ներկա պահի համար
//որտեղ պարամետրը ընդունում է 1 կամ 2 արժեքները, և հաշվարկները կատարվում են ՏԱՐԲԵՐԱԿ 1 կամ ՏԱՐԲԵՐԱԿ 2 -ին համապատասխան

1.2
$ArmDate = new ArmHaykyanDate("2013-10-16 11:12:40",1); 
//որտեղ առաջին արգումենտը MySQL ֆորմատով ամսաթիվն է, երկրորդը՝ հաշվարկի տարբերակը


1.3
$ArmDate = new ArmHaykyanDate(2014,8,11,2,1); 
//որտեղ արգումենտնենրն են համապատասխանաբար տարեթիվ,ամիս,օր,ժամ և տարբերակ


------------------------2. ՄԵԹՈԴՆԵՐ---------------------------

$ArmDate.getArmHaykyanDate();
վերադարձնում է ամսաթիվը տողի տեսքով


-----------------------3․ ՀԱՏԿՈՒԹՅՈՒՆՆԵՐ----------------------

$ArmDate->ArmHourName;	  	   //Հայկյան ժամանուն
$ArmDate->$ArmDayName;		   //Հայկյան օրանուն
$ArmDate->$ArmMonthName;	   //Հայկյան ամսանուն
$ArmDate->$ArmYear;		  	   //Հայկյան տարի
*/


class ArmHaykyanDate {

	private $EpYr; //Հայկյան տոմարի տարբերությունը մեր թվարկության համակարգինց տարիներով 
	private $YrM;  //ամանորի ամիսը
	private $YrD;  //ամանորի օրը

	private $Date; 			  //Կոնվերտացվող ամսաթիվը
	private $monthNum;  	  //Ամսվա համարը
	private $dayNum;		  //Օրվա համարը
	private $yearNum;		  //Տարին
	private $StartOfThisYear; //Տվյալ տրավա համար տարվա սկզիբը

	public $ArmHourName;	  //Հայկյան ժամանուն
	public $ArmDayName;		  //Հայկյան օրանուն
	public $ArmMonthName;	  //Հայկյան ամսանուն
	public $ArmYear;		  //Հայկյան տարի
	


 	public function __construct() 
 	{
 		$a = func_get_args(); 
        $i = func_num_args(); 
        if (method_exists($this,$f='__construct'.$i)) { 
            call_user_func_array(array($this,$f),$a); 
        } 


 	}

 	public function __construct1($tarb)
 	{
 		$this->setTarberak($tarb);
    	$this->Date=getdate();
    	$this->createArmDate();
   	}

	public function __construct2($DateMySql,$tarb) 
 	{
 		$this->setTarberak($tarb);
		$this->Date = getdate(strtotime($DateMySql));
    	$this->createArmDate();
    } 	

 	public function __construct5($year,$month,$day,$hour,$tarb) 
 	{
 		$this->setTarberak($tarb);
        $this->Date=getdate(mktime($hour,00,00,$month,$day,$year));
    	$this->createArmDate();
    }

	function __destruct() 
	{
       
   	}


 	private function setTarberak($tarb) //Ընտրում է հաշվարկների տարբերակներից, տես սքրիփթի սկիզբը
 	{

    	if($tarb==1)
    	{
			//Տարբերակ 1 -ի համար
	       	$this->EpYr=2492; //մթա
	       	$this->YrM=8;
	       	$this->YrD=11;

    	}
    	else
    	{
			//Տարբերակ 2 -ի համար
	       	$this->EpYr=2341; //մթա
	       	$this->YrM=7;
	       	$this->YrD=14;
    	}


 	}

 	private function createArmDate()
 	{
	    //Բուն Հայկյան ժամը
	    $h = $this->Date;
	    $this->ArmHourName = $this->HourNames[$h['hours']];

		//Տարվա առաջին օրվա որոշումը
		$this->monthNum = $h["mon"];
		$this->dayNum = $h["mday"];
		
		$this->StartOfThisYear = getdate(mktime(00,00,00,$this->YrM,$this->YrD,$h["year"]));

		
		//Օրերի քանակը, որը անցել է սկսած Օգոստոսի 11-ից, կարող է լինել նաև բացասական
		$daysleft=floor(($this->Date[0] - $this->StartOfThisYear[0])/60/60/24);
		
		//Բուն Հայկյան Տարի և անցած օրերի ճշտում բացասականի դեպքում
		$this->ArmYear = $this->EpYr + $h["year"]+1;
		if($daysleft<0)
		{
			$this->ArmYear=$this->ArmYear-1;
			$this->StartOfThisYear = getdate(mktime(00,00,00,$this->YrM,$this->YrD,$h["year"]-1));
			$daysleft=floor(($this->Date[0] - $this->StartOfThisYear[0])/60/60/24);
		}

		
		//Բուն Հայկյան Ամսանուն
		//TODO դզել հաշվի առնելով բացասական օրերի հարցը և վերջին ամսվա հավելյալ 5 օրերը
		$monthsleft = floor($daysleft/30);
		$this->ArmMonthName = $this->monthNames[$monthsleft];

		//Բուն Հայկյան Օրանուններ
		if($daysleft-30*12>0) // ավելյաց ամսվա օրանունները
		{
			$avOr = $daysleft-30*12;
			$this->ArmDayName = $this->avelyac[$avOr];
			
		}
		else
		{
			
			$daynmbr = $daysleft - floor($daysleft/30)*30;
			$this->ArmDayName = $this->dayNames[$daynmbr]; 
		}
 	}
 
 	public function getArmHaykyanDate()
 	{
 		return "Տարի՝ ".$this->ArmYear." ".
   			   "Ամիս՝ ".$this->ArmMonthName." ".
   			   "Օր՝ ".$this->ArmDayName." ".
   			   "Ժամ՝ ".$this->ArmHourName;
   	}
 	

 	public function getPropertyes()
   	{
   		
   		return "<br>ArmYear=".$this->ArmYear.
   			   "<br>ArmMonthName=".$this->ArmMonthName.
   			   "<br>ArmDayName=".$this->ArmDayName.
   			   "<br>ArmHourName=".$this->ArmHourName; 
   	}


	//Մասիվներ
	//օրանուններ
	private	$dayNames=array(
					"Արէգ",
					"Հրանդ",
					"Արամ",
					"Մարգար",
					"Ահրանք",
					"Մազդեղ կամ Մազդեկան",
					"Աստղիկ",
					"Միհր",
					"Ձոպաբեր",
					"Մուրց",
					"Երեզկան կամ Երեզհան",
					"Անի",
					"Պարխար",
					"Վանատուր",
					"Արամազդ",
					"Մանի",
					"Ասակ",
					"Մասիս",
					"Անահիտ",
					"Արագած",
					"Գրգուռ",
					"Կորդուիք",
					"Ծմակ",
					"Լուսնակ",
					"Ցրոն կամ Սփյուռ",
					"Նպատ",
					"Վահագն",
					"Սիմ կամ Սեին",
					"Վարագ",
					"Գիշերավար"
					);

	//ժամանուններ
	private $HourNames=array("Խաւարականն",  //գիշերվա 00
					"Աղջամուղջն", 
					"Մթացեալն",
					"Շաղաւոտն",
					"Կամաւօտն",
					"Բաւականն",
					"Հաւթափեալն",
					"Գիզկան",
					"Լուսաճեմն",
					"Առաւոտն",
					"Լուսափայլն",
					"Փայլածումն",
					"Այգն",
					"Ծայգն",
					"Զօրացեալն",
					"Ճառագայթեալն",
					"Շառաւիղեալն",
					"Երկրատեսն",
					"Շանթակալն",
					"Հրակաթն",
					"Հուրթափեալն",
					"Թաղանթեալն",
					"Առաւարն",
					"Արփողն"
					);
	
	//ամսանուններ
	private	$monthNames = array(
					"Նավասարդ",
					"Հոռի",
					"Սահմի",
					"Տրե",
					"Քաղոց",
					"Արաց",
					"Մեհեկան",
					"Արէգ",
					"Ահեկան",
					"Մարերի",
					"Մարգաց",
					"Հրոտից",
					"Ավելյաց");

	
	//ավելյաց օրանուններ
	private $avelyac = array(
					"Լուծ",
					"Եղջերու",
					"Ծկրավորի",
					"Արտախույր",
					"Փառազնոտի");


}

?>